app/views/books/index.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 11]]
---
            <td><%= book.body %></td>
            <td><%= link_to "コメント#{book.post_comments.count}件", book_path(book.id), class:"small" %></td>