app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]
---
          <%= link_to book_favorites_path(@book_find), method: :delete, class:"mb-3" do %>
            ♥<%= @book_find.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]
---
          <%= link_to book_favorites_path(@book_find), method: :post do %>
            ♡<%= @book_find.favorites.count %> いいね

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 11]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 11]]
---
      <div class="my-3">
        <div class="border-bottom"><%= @book_find.post_comments.count %>件のコメント</div>
        <div><%= attachment_image_tag @post_comment.user, :profile_image, size: "30x30", format:'jpeg' %></div>
        <% @book_find.post_comments.each do |post_comment| %>