app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "guest@example.com"], ["LIMIT", 1]]
---
  def guest_sign_in
    user = User.find_or_create_by!(email: 'guest@example.com') do |user|