app/controllers/books_controller.rb

  def index
    @books = Book.page(params[:page]).reverse_order
---
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice:'You have created book successfully.'
    else
      @books = Book.page(params[:page]).reverse_order
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["user_id", 1], ["created_at", "2021-05-03 06:03:58.528984"], ["updated_at", "2021-05-03 06:03:58.528984"]]
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    @book_find = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def search
    if params[:title].present?
      @books = Book.where('title LIKE ?', "%#{params[:title]}%")
---
SELECT "books".* FROM "books" WHERE (title LIKE '%b%')