app/controllers/post_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "🐶"], ["book_id", 11], ["user_id", 1], ["created_at", "2021-05-06 05:49:06.033418"], ["updated_at", "2021-05-06 05:49:06.033418"]]

  def destroy
    PostComment.find_by(id:params[:id], book_id:params[:book_id]).destroy
---
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 3]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."book_id" = ? LIMIT ?  [["id", 3], ["book_id", 11], ["LIMIT", 1]]