app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    @user = User.find(params[:id])
    @books = @user.books.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    #@user_find = User.find_by(params[:id])
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]